CFD/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;//0.008;

vertices
(
    (0. 0. 0.)
    (1.0   0   0)
    (1.0 1.0   0)
    (  0 1.0   0)
    (  0   0 1.0)
    (1.0   0 1.0)
    (1.0 1.0 1.0)
    (  0 1.0 1.0)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (32 32 32) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
	     type cyclicAMI;
	     neighbourPatch outlet;
	     faces    ((0 3 2 1));
     transform      translational;
     separationVector (0 0 1);
    }

    walls
    {
	     type wall;
	      faces (
        (2 6 5 1)
        (0 4 7 3)
        (3 7 6 2)
        (1 5 4 0)
    	);
    }
    outlet
    {
	      type cyclicAMI;
	      neighbourPatch inlet;
        faces     ((4 5 6 7));
        transform       translational;
        separationVector (0 0 -1);
    }

    /*empty frontAndBack
    (
        (0 3 2 1)
        (4 5 6 7)
    )*/
);

mergePatchPairs
(
);

// ************************************************************************* //
