CFD/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type                cyclicAMI;
        value           uniform (0 0 0);
        //type            fixedValue;
        //value           uniform (0 0 0);
        //type                flowRateInletVelocity;
        //volumetricFlowRate  0.2;
        //extrapolateProfile  yes;
        //value               uniform (0 0 0);
    }

    wall
    {
        //type            zeroGradient;
        type            fixedValue;
        value           uniform (0 0 0);

    }

    outlet
    {
        type            cyclicAMI;
        value           uniform (0 0 0);
        //type          zeroGradient;
        //type            fixedValue;//zeroGradient;
        //value          uniform (0 0 0);
    }

    /*frontAndBack
    {
        type            empty;
    }*/
}

// ************************************************************************* //
